["maybe today is the day that i finish writing my book","I don't know what people hate more : people who wear backpacks on trams or people who get 9 hours sleep a night","Karl Stefanovic dumped as Today show co-host by Channel Nine","How the world has fought back against the violent far-right and started winning | Jason Wilson","Why can't I wake up? I vow to cut down - but I love sleeping | Brigid Delaney","Anand Giridharadas on elite do-gooding: 'Many of my friends are drunk on dangerous BS'","pondering the horrible irony of writing a story about oversleeping after only getting 5 hours sleep \n@mtats","Film director and TV star Penny Marshall dies aged 75","Fifty shades of g'day: MP sexting scandal turns Australians off beloved greeting","If you are feeling gloomy - I really recommend listening to Radiohead's Ok, Computer\nSo cheery!!","Today was hard. Funeral for a young bloke who took his life. There are people you can call","you life is what I aspire to!!! @mlle_elle\n\n'A reader told me I was wasting my life': what I learned after my money diary went viral","‘I’d love to scream at them’: how showroomers became the No 1 threat to bookshops","Reading Helen Garner's The Children's Bach for the first time - and it's good but slightly brittle....","googling \"bad first drafts - novel\" - and it is a thing.... even @StephenKing advises that first drafts can be rubbish. you just have to power through and not feel too much shame about your horrible work","it's painful reading the first draft of a novel (your own novel) . so bad.","Workers’ rights? Bosses don’t care – soon they’ll only need robots | John Harris","despite only spending 60 nights a year at home - somehow I have been roped into hosting the street Christmas party.","Gym crowded at 4pm. People preempting their New Years resolutions","best Christmas song ever","no one should have their sexting made public . it's very cruel @NewIdeamagazine","Our lock-and-leave culture: the rise of self-storage and clinging to stuff we hardly use","this piece on the secret to ageing well is good --","\"there's no other way... there's no other way.....\"\n\nDamon Albarn joins call for citizens' assembly to break Brexit deadlock","'Enough madness': can playing it safe win Michael Daley the NSW election?","Strange case of theatre historian, 90, mistaken for one-armed terrorist","Why are people still climbing Uluru? – video https://www.theguardian.com/world/video/2013/jul/09/uluru-climb-video?CMP=share_btn_tw …\n\nThis is a really great video by @oliverlaughland from 2013 about why people are still climbing Uluru and how traditional owners feel about it","To clarify - I have no issue w\n@TrentDalton reporting re climbing Uluru. He's great & nuanced as always- but it's the way the story is pitched on the cover of the magazine. It's long been established that climbing Uluru is contrary to wishes of Anangu people. Why debate it?","Very disappointed in the Weekend Australian coverline on their magazine: magnificent Uluru with the words \"To climb or not to climb?\" Of course not. Sacred site. @TrentDalton - why is this still up for debate?","Miss USA apologizes for mocking rivals' English-speaking skills","'The saddest image': courtroom sketch captures Michael Cohen's bad day","Keith Richards gives up drinking (almost), saying 'I got fed up with it'","loving listening to this 2018 BEST OF episode of Stop Everything on @RadioNational \nagree - childish gambino This is America - best video of the year\n@mrbenjaminlaw @oz_f","so my column today is about getting sunstroke \nspoiler alert: it's no fun","it's gloomy outside","‘Precious works of art’ – Akira Isogawa’s unique fashion celebrated in retrospective","My fears about liberalism are pretentious and I'm a slow walker – my day on retreat | Brigid Delaney","Modelling wasn’t for me. My real passion is being a nurse | Katarina Keeler","ugh - bad news email : \"The Snake and Spider First Aid workshop has been postponed until the new year.\"\n\nwhat if I am bitten this year??","I'm a loyal expedia customer; \n\n\"Your monthly statement - you have 428 points worth AU$3.06\"","ICAC!! \n\nMorrison government announces new federal anti-corruption commission","I don't know why anyone would want to be the British prime minister. looks like a horrible job right now","Polly Toynbee on the mess that is UK politics -- “All the old gentlemanly conventions have long vanished from our demented remnant of a government”","Twitter chief Jack Dorsey responds to criticism over 'amazing' Myanmar tour","Olga Edwards, Sydney woman whose ex-husband murdered her children, found dead","Of all the best places to retire in the world … none are in the US","Back to meditating twice a day . Yet to feel any tangible benefits","How do you tell if a moth is sleeping or dead ?","The answer for women who feel worthless is not 'you are beautiful' | Calla Wahlquist","What is behind the spread of a mysterious allergy to meat?","Worst song ever","Two years ago I met the hyper-masculine kangaroo on a trip to Alice springs . Was really as ripped as he looked in the pictures. Also didn't look old - so his death comes as a surprise . Rest In Power","yay --- super commuting is going to be even easier with the Bendigo - Syd new @Qantas flights starting next yr!!","Trying to take the big puffer and big backpack on the tram at once - nightmare","good thread","how the Barefoot Investor took over Australia....\nfrom me -- \n\n'It's a movement': how the Barefoot Investor changed what's in our wallets","Australia gave endangered birds to secretive German ‘zoo’, ignoring warnings","The gun with cross-stitching , you know -- the Smocking Gun","From me \n\n'It's a movement': how the Barefoot Investor changed what's in our wallets","Death of Roger, the ripped kangaroo, sparks outpouring of grief on social media","In the future , the only people I want to be friends with are those that carry fully loaded portable phone chargers","That thing when you are so late but you have invested so much time waiting for the bus , that taxi is a moral failure","With my 80 ltr backpack","First time ever getting the no 70\nDocklands tram","Ai Weiwei: 'The mood in Germany is like the 1930s'","So if you like the Daily -- and the new Guardian podcast - Today, In Focus -- here are some more\n\nPodcasts Are Getting Newsier. Here Are 8 New Ones Worth a Listen.","just been listening to this great podcast about medical mysteries -","Chess live blog!!\n\nNo move is a good move for the Guardian columnist 63 years in post | Paul Chadwick","looking forward to spending today doing my taxes!","Great thread about meditaton and Myanmar","Teacher's Pet: can 28m podcast downloads change the course of a murder case?","Sometimes the only reason to write a novel is so you apply for arts residencies in chateaus","‘That warrior sound’: the band fusing power metal with politics in remote Australia","John Kelly to leave as Trump White House chief of staff at end of year","Trump lashes out at Mueller after bombshell Cohen and Manafort filings","Hannah Gadsby meets Roxane Gay: ‘Trolls get incensed by a woman daring to think she's funny. I'm very funny’","I deleted all my social media posts – almost like setting fire to my (mundane) diary | Alex McClintock","This hotel has DVDs! Night in with the ultimate DVD: The Hangover","Or \"a generation\"","Strong opinions on backpacks ! including offenders being kicked to death !!","just walking down Fitzroy St in st Kilda and a limo stops at the traffic lights and a guy sticks his head out, shakes up a bottle of champagne, sprays everyone at the tram stop, laughs and drives off.","hey so I'm finding out literally no one is backing me with the 'backpacks worn on trams' thing\nits hard swimming against the current, but feels good to stand up for my beliefs","Medical advances could soon spare patients surgery, say experts","It's refreshing to hear the autumnal, forest glade sounds of Fleet Foxes while sitting in this st kilda cafe w no aircon, recovering from heatstroke , and having a hot breeze turn my skin to parchment","thoughts on people who wear backpacks on trams.","from me --- \nI was told off for wearing a backpack on a tram. Had I missed the memo of the latest no-no?","My uber driver father was jailed as a political prisoner in Ethiopia and I just complain to him about heatstroke","How do i treat sunstroke .! Want to throw up","I have sunstroke !!!","Just got a hotel room upgrade ! It's easy!!! I just paid extra for a bigger room","Amazing movie . Most unforgettable of 2018","one thing that I have noticed in melb and syd - supposed sophisticated coffee cities - is that it's hard to get a coffee after 3pm unless you go to a 7/ Eleven. All the cafes open 7am - 3pm","there are two types of people : those that can drink coffee all night -- BLACK COFFEE EVEN and still sleep.... and whose fragile systems won't allow them to imbibe caffeine after 3pm.","Australians are a rules based society","the room in this hotel I am staying at is so small, that I think I will stay here if I ever need to write a creative non-fiction book about prisons","From the small sample size it appears that around 3pm is last orders for coffee drinkers 🙋🏼‍♂️","Seldom aired, rarely screened sitcom Friends","Hi people - genuinely curious about what time of day people have their last coffee . I'm thinking of pushing the boat out and getting a piccolo at 4pm","Prime Minister’s Literary awards 2018: Gerald Murnane wins for 'exquisite' novel","Newly remarried, Goop CEO Gwyneth Paltrow is living her best life—and believes she can help you live yours better, too via @WSJ","very pleased that one of my favourite airlines: AIRASIA is now flying out of one of my favourite airports - AVALON","'Tip of the iceberg': Gangland lawyer claims she tried to expose Informer 3838 via @smh","Michelle Obama’s show was remarkable – her wisdom is a beacon | Afua Hirsch","Guilty pleasures? For women that’s most of our culture","Parliamentary barbecue celebrates Indigenous rangers, a good news story in a week of turmoil","spent the morning reading melb newspapers..... that lawyer X story is SO INSANE \nits the most insane story of the year IMHO\nThere will be a movie......","the Bag-One","I wish my life problem was: addicted to exercise","\"don't blush baby\"","Cricketer Chris Gayle awarded $300,000 in Fairfax defamation case","Back from the brink: new breath for tourism in Istanbul","How is it possible to STILL be jetlagged ??","Sally Rooney: ‘I don’t respond to authority very well’","Yoga v pilates: both are popular, but which would work best for you?","Supermarket ban sees '80% drop' in plastic bag consumption nationwide","'I am worried': Macron's chat with Saudi prince captured at G20","Started meditating again. It's both hard and easy. How do you stay awake ? 🙌🏽","this is a v distressing letter --- \n\nA letter to… my used-to-be son","Lena Dunham is a hugely original writer. Who cares if she’s a good person? | Martha Gill","The places we swim - a picture essay","'It's not even scratched the surface': bank victims demand royal commission 2.0","Also went to a hot yoga class and there were only 3 people in it - which is how it should be always","So Star is Born . Saw it today. very sad. (But good) Should be called Star has Died","First time ever at crown casino !!!","Sydney house prices have biggest monthly fall for 14 years and Melbourne close behind","I make life unintentionally difficult for others by taking an enormous backpack on a crowded tram at peak hour","Because I got up at 4am, I'm now going for knock off drinks. Need to be in bed no later than 5:30pm","I wish these climate kids could vote . We selling their future for a lump of coal ⚰️🔥🚢☠️","This is me actually having a panic attack in the cave. Read the column today in guardian","An argument can be made that Leunig contributes to this anxiety and anger by making drawings that demonise working mothers, for example.","Your right to know: how Australia's defamation law stifles public interest journalism | Richard Ackland","pls introduce robots to clean my house!!","I have often wondered about this","My diary -- TRIGGER WARNING FOR CLAUSTROPHOBICS \n\nDid I die in a cave 20 metres underground in Turkey? | Brigid Delaney's diary","omg","Going to bed at 5pm makes getting up at 4am very easy","Why is Australia so keen to reward films full of staggering misogyny? | Andy Hazel","one year after I was robbed in old Delhi - I have finally got around to ordering a replacement Learners permit. \nNow - I will learn to drive again!!!\n I feel sad for the Indian driving round on my license \nping @safimichael","mr nick clevershed\n\nNo lie, Knickers the big cow is actually quite large","maybe I'll just go to sleep for a bit now... that will get rid of jetlag","I'm never leaving australia ever again","5 days later and my jetlag is still horrific","‘You need to prepare yourselves’: how a good review can destroy a restaurant","housework is the worst work","Canada: mother and baby killed by grizzly bear in Yukon","Omg!!!","one of my worst nightmares is to live next door to crazy ice users who have wild dogs & frequent parties with bikers","Former police minister Matt Brown caught with drug ice in Queensland via @smh","This obit -- omg --- \n\n“ she started smoking at the age of 10 and gave up at 79”","I went travelling and left this big thing in the overhead locker!!!","Guy quits as Victorian Opposition Leader after election disaster via @ABCNews","'A community in unbelievable pain': the terror and sorrow of Australia's Uighurs","its not often you see a news story and think \"I want to eat that\"\n\n#BIGCOW","Big Cow is a better story than poo jogger + spider mouse","story I cannot get enough of..... \n\nthe BIG COW","Nearly 30 whales stranded on remote Victorian beach","Syrian refugee stranded in airport for months is granted asylum in Canada","hello castlemaniacs","jetlag is too high a price to pay for anything, anywhere","great guy - well deserved @JockSerong \n\nAward for thriller without violence against women goes to Jock Serong","me to NAB\n\"I'd like to dispute a transaction\"\n\"Who with?\"\n\"A hamman in Istanbul\"\n\"An Iman?\"\n\"No a hamman.\"","could it be that my airbnb guests have stolen the flyscreen on my kitchen window?","just went to my Nanna's old house in west geelong and its been knocked down and turned into two ugly grey townhouses.","Puffer Squad Goals","How dealing with past trauma may be the key to breaking addiction","old New York \n\nA Walking Tour of Manhattan’s Rock ’n’ Roll Past: the 2000s","I NEED to get my driver's license","So jetlagged I have to ring my dad to pick me up from the music festival","I'm a Burberry Socialist","Nothing wrong with a Burberry trench imho","Off-the-plan units warning as more buyers settle at lower valuations","Re fear campaigns about population growth -- chill people .... just back from Istanbul . Population 19 million. They took in 4 million Syrian refugees . Place far from perfect but it works. There's room for more people in Australia","Labor's election win in Victoria delivers a stunning margin and a new party hero | Gay Alcorn","Note to taxi drivers - if you are talking to a female passenger about the MeToo movement and then launch into an example that starts with: \"Don't mean to scare you, but say if I raped you....\" that's scary dude! Don't say that , even as a hypothetical","this seems like weird advice","just arrived back in melbs to a labor victory \n\nNice one @DanielAndrewsMP & @CathLAndrews !\n\ngood mix of progressive values + infrastructure stuff getting done","You think 2018 is the worst year ever? Try the real dark age: 536 | Kate Williams","just checked my credit card statement and wondering of 45 min at a Turkish hamman really would cost $530 or if I've been scammed??","this 7 hour delay at doha is killing me","Obsessed now with magical turkey . Have bought Norman Stone's \"Turkey, a short history\" and Orhan Pamuk's \"Istanbul\" for the long plane trip home","Took the big puffer to turkey . Mixed experience . It insulated me when I slipped on black ice in a cheese museum but it smashed a salt shaker and a grim dog tried to hump the sleeve and I couldn't shake it off","back in istanbul. it's got to be in the top 10 of world great cities. smells like shish, meat, rose water, Turkish delight, cigarettes \nsounds like people having incredibly lively conversations punctuated by call to prayer","Off to a scary Hamman","Love this by @stupidtrav\n\nWhat makes kookslams so compelling? Schadenfreude, self esteem and our shared humanity | Travis Lipshus","Just had a weird dream that i was involved in a violent armed robbery at a salad bar. I got my phone back from the robbers but the screen was smashed","Unmade Sex and the City 3 was meditation on grief after death of Mr Big","Gatwick hotel: women who lived at rooming house jailed after sale to Channel Nine","It's a good good morning over Cappadocia","better than Christmas..... setting your alarm early because you are going on a dawn hot air balloon ride","'Epidemic of time theft': Australians work two months' unpaid overtime a year","This hotel offers a massive plate of Turkish Delight for breakfast","My wrist still aches from my fall in the cheese museum","Some nights sleep are so good , you never want to wake up","just arrived in the city of Ankara - and the airport is crazy crowded. It's because Putin is here! Yay :(","watching Turkish television is horrible - particularly when you don't speak Turkish","This is so great\n\nDon’t Call It a Comeback: Seinfeld, Ep. 181 “The Grovel” - McSweeney’s Internet Tendency","Today's travel injury : slipping on black ice and hurting my wrist in an east Anatolian cheese museum","The sky in this part of turkey -- so big / epic","Tonight /-/ minus 7. 😿🔥","Off to dinner in a really Conservative part of rural turkey . No alcohol in restaurants . But apparently the specialty is goose","This is cool - some Australian women in turkey running an NGO assisting Syrian refugees in Istanbul . They had us over for dinner tonight","Saudi crown prince shielded as death penalty sought over Khashoggi murder","Love it how in Instabul, I've just pulled a half eaten croissant from my handbag, that's travelled all the way from Castlemaine","Bali Nine drug smuggler Renae Lawrence to face arrest upon arrival in Sydney","Qatar -- everything made of gold","they let me on the Skybus for free tonight","gmail predictive text has advised that I reply to an email from my editor-in-chief with the word \"Yum!\"","I couldn't care less how Bunnings construct their sausage in bread","22:30 = 10:30pm","brilliant artist","I have to fly internationally at 22:30\n\nwhat time is that????","from me\n\nPolly Borland on art, drugs and Melbourne in the 80s: 'It was kind of a free-for-all’","I really hate doing housework \n\nit feels like such a waste of time \n\nbut it must be done","after 11 hours sleep - I feel INVINCIBLE!!","long read:\n\nThe plastic backlash: what's behind our sudden rage – and will it make a difference?","actually its not a parking ticket - its a seatbelt thing","very pleased to have a lawyer helping me fight this parking ticket fine. was meant to be in court today - in Sydney. justice delayed is not necessarily justice denied","If I pack big puffer I will not be able to pack anything else . It will he minus 20","Stan Lee: Spider-Man, X-Men and Avengers creator dies aged 95","Bourke Street attack: Morrison accused of 'scapegoating' Muslim community","if I take my big puffer to Turkey later this week, it will take up all the room in one whole overhead locker","I'm sure I'm not the only one...........\n\nNew to Melbourne, it was Pelligrini's that welcomed me in | Brigid Delaney","Donations flow in for Melbourne attack's 'trolley man'","Amazing story of hunger + romance 🌺🙀","Experience: I was kidnapped by my lodger","Michael Daley that is, not foley","Was briefly his press secretary. decent guy- ran a good office","Inspired by Geoff Dyer I came to boring Ubud to write. The universe had other plans | Brigid Delaney's diary ping @mmccwill","NSW Labor sources shocked by Luke Foley’s decision to sue for defamation","Inspired by Geoff Dyer I came to boring Ubud to write. The universe had other plans | Brigid Delaney's diary","Dutch man, 69, starts legal fight to identify as 20 years younger","NSW Labor leader Luke Foley resigns but denies explosive harassment allegations via @smh","All politicians should resign and we should reorganise into self governing agrarian communities","Luke Foley is gross.\nWhy would people vote for him after this ?\n\nStatement 8 November 2018","Hot White House","Night flight back from Bali & so many people on the plane are in bandages, slings , limping , covered in grazes . All scooter accidents I bet","Geoffrey Rush defamation trial: Eryn Jean Norvill 'utterly honest' witness, court told","After a bitter campaign, Americans head to polls: 'A race between love and hate'","Who said it: Scott Morrison or another fair dinkum Aussie?","this is a v depressing article \n\n12 Young People on Why They Probably Won’t Vote via @intelligencer","It never occurred to me that Rihanna has a last name --- and that it is Fenty.","If the most late night city in the world is Madrid - then Ubud is the earliest night city . Arranging to meet people for dinner and they will say 5:30pm because their bedtime is 8pm","XXXX Gold is a terrible beer","'Freakish miracle': New Zealand fisherman pulls drowning toddler from ocean","Why we still can’t stop talking about Jamal Khashoggi | Nesrine Malik","Don DeLillo on Trump's America: 'I'm not sure the country is recoverable'","Nightmare ! \n(or should that be Night mare?)","It's been 3 yrs now since the Melb cup daily mail drunk bin diver pics were taken","Virgin Australia has second thoughts on acknowledging veterans","Stephen Fry pronounces the death of classical liberalism: ‘We are irrelevant and outdated bystanders’","Joseph Stiglitz: 'America should be a warning to other countries'","Stoic week , and what I learnt , is still resonating w me","this is true","'Nobody could make me laugh like you': Instagram memories of those lost to Aids","You never know when you buy a coconut if it's going to be one with 3 litres of liquid that take all afternoon to finish or if it's all over after 3 sips","'Is our life just worth a photo?': the tragic death of a couple in Yosemite","now in addition to all the other shootings - there's yoga studio shootings.....\n\nFlorida yoga studio shooting: two killed before class members tackle gunman","I choose to work forever","weirdly the opening chords of REM's Drive sound almost identical to the opening chords of Bon Jovi's Dead or Alive","that old copyright problem.... one of the characters in this thing I am writing is SUPER into REM (the band, not the phase of sleep) and if for them to sing a song in the book it's going to cost me a motza in rights. oh well..... \n\"That was just a dream/just a dream.\"","oh no - -- I was hoping this would get the green light \n\nAntarctic's future in doubt after plan for world's biggest marine reserve is blocked","This is stunning, beautiful and wise","Geoffrey Rush defamation trial brings drama to the courtroom","Jamal Khashoggi's body was 'dissolved', says Erdoğan adviser","Meat martyrs be warned: the vegans will inherit the Earth | Gaby Hinsliff","Raw vegan nachos were v good","wtf ??!!\n\nNigel Scullion gave Indigenous funding to his former fishing lobby group to fight land claims","Ross Cameron sacked from Sky News after racist comments about Chinese people","rereading Lolita - and the last part contains some of the finest writing of the twentieth century. This line kills me: “He broke my heart. You merely broke my life.”","omg - this is the most iNSANE story of the month (so far) \n\nMelbourne cafe bombarded with bad reviews after year 12 exam question","should I give some of my airbnb guests a bad review because they left their underwear in my bed?","mixed emotions about this.","I think you write a book to exhaust yourself of any interest/ curiousity about the subject \nI am finding in my time in Ubud that overhearing any talk of WELLNESS makes me feel quite ill \n#wellmania","my late breakfast is being compromised by the table next to me discussing how many emenas a day are optimum. \n\"Seven to 10.\"","Barnaby Joyce accuser Catherine Marriott hailed by WA Nationals as she tells of her pain","From MeToo to deforestation: Indonesian writers on their country's biggest challenges https://www.theguardian.com/culture/2018/oct/31/from-metoo-to-deforestation-indonesian-writers-on-their-countrys-biggest-challenges?CMP=share_btn_tw …\n\nMy wrap on the Indo speakers at this year's wonderful @ubudwritersfest","👻","I agree. Halloween is the worst thing ever.","can't believe I once tried to write an entire novel in the first person plural","‘Remember you will die’ – and 11 other tips for a better death","From MeToo to deforestation: Indonesian writers on their country's biggest challenges","after working since 4:30am - i have earnt this cold Bintang","From Hollywood to teaching high school: how a film-maker dealt with failure","Humanity has wiped out 60% of animals since 1970, major report finds","I have two gardeners with a combined aged of 156 & they are SUPER STRONG","I am writing about Sweet Valley High --- so don't pitch that people","Super strong cover image on New York Magazine this week","The looming collapse of the housing market: bring it on! | First Dog on the Moon","oh man - the bolthole where I am writing for the next couple of weeks is kind of in a jungle & the nearest place for food / coffee is a raw , vegan place. Experimenting w espressos to avoid the whole almond milk thing","this is beautiful","We're winning the war on Word, fellow writers. Enjoy the freedom | Jason Wilson","Loved seeing one of my favourite writers Geoff dyer . He makes me want to go to burning man even tho it sounds grim @ubudwritersfest","interesting mix here of progressive social policy plus infrastructure achievements.","Coalition embraces economic vandalism with worst possible energy policy | Alex Turnbull","worst hotel ever - I have to ring reception to get the lights in my room turned off - because the light switch is OUTSIDE the room somewhere, but staff won't tell me where it is.","Today marks a year since I gave a half day seminar on breaking news journalism, using Grenfell\nTower disaster as an interactive exercise, only to find out at the end I was in the wrong classroom 😔","my diary for this week -- \nMy detox doctor has been deregistered – it's a surprise this doesn’t happen more | Brigid Delaney's diary","I spend my summers in the town where this is set - and it has the WORST TRAFFIC of anywhere and massive queues for lattes/ gelato. It IS the rat race","just interviewed the amazing Australian artist Polly Borland via a very scratchy Skype call btw Indonesia and LA. Her exhibition - on right now at the @NGVMelbourne was my highlight of the @melbfestival","Indonesians fight for more 'smelly money' to bear life near Jakarta's landfill mountain","Always interesting to get an outsiders view on Australia. The Economist sees Oz as the most successful country in the world on many measures - but room for improvement w climate, Indigenous affairs and off shore detention -","Drama at Geoffrey Rush defamation trial as actor's friend bursts into song","Sir Philip Green named as man at heart of 'UK #MeToo scandal'","Last week my fasting doctor was deregistered ---When I did an extreme fast I was worried not eating would kill me | Brigid Delaney's diary","Festival fail -- meant to go see Omar Musa perform . Decide instead to go to bed at 9pm","Sitting in an interesting session at @ubudwritersfest - the environmental challenges facing Indonesians -- of which there are many","❤️😔","The very nice media centre at @ubudwritersfest","I got tickets to Charlie sheen","one thing I am looking forward to most at @ubudwritersfest - Geoff Dyer in conversation with @mmccwill \n\n(I want to know if the character in Jeff in Venice went mad or actually had a proper religious conversion )","Helen Garner's Monkey Grip makes me examine who I am | Charlotte Wood","BIG PUFFER","List: If People Talked About Other Things the Way They Talked About Gender Identity - McSweeney’s Internet Tendency","There's been a bit about Julia Gillard in the news this week -- and I've realised....I miss her","Good long read about dicks in film \n\nFull frontal: why the fuss over Chris Pine's 'dazzling' penis?","Sad to miss the CumTown podcast live show in Sydney tonight . Listened to 2 episodes .","Last row, last seat on full Jetstar flight to Bali, seated right next to the toilets 😾","On closing my NAB credit card just now. \nNAB call centre: \"Why would you want to do that?\"\nMe: \"Because I don't want to be in debt anymore.\"\n\nthere is really no corporate come back to that","utterly lovely ---- \n\nIs love best expressed with poetry?","off today to the @ubudwritersfest -- one of the best literary festivals in the world. Not only do you hear from all the normies that win the prizes and are on the festival circuit - but there's all this great Indo and ASEAN talent who are writing awesome books about the region","Melbourne International airport - perpetually like a half constructed Westfield mall","Labor says it's prepared to strike deal with Coalition to get children off Nauru","At last........","P&O cruise ship dumped 27,000 litres of waste on Great Barrier Reef, Senate hears","Nature is amazing ! I grew this pretty tree even though I am literally never at home to care for it","Sometimes - like now - I go to the gym and sit on the couch, playing on my phone . But at least I can say \"I've been to the gym today\"","I wish my days were less joyful and more productive","Yeah same 👏🏼","Big national apology today to survivors of institutional child abuse. \n\nThis is required listening.... an incredible podcast by @milesage @MelissaLDavey & David Marr about the road to the Royal Commission","so weird when commentators and politicians claim something - in this case the electorate of Wentworth - is not the \"real Australia.\" If it exists - then it is REAL !","blimey -- this story is SO HORRIFIC... “Khashoggi’s fingers were cut off while he was held down, the recording suggests.” https://gu.com/p/9yh6n/stw \n\nHe was then injected with something to stop him from screaming","this long read by one of the best --- @martinchulov\n\nJamal Khashoggi: murder in the consulate","nothing like a replacement bus service 👐🏽","Jane Caro poised to run against Tony Abbott in seat of Warringah","I live for by-elections","Luckily it's cold in melbs as I had to wear 3 jumpers, a poncho , 2 scarves , a hoodie and a jacket on the plane to avoid a Tiger Air $75 baggage charge","Great backgrounder by Anne Davies\n\nAfter a chaotic campaign comes the day of reckoning in Wentworth","At Sydney airport and looking unlikely that we'll fly out in this weather","Whenever I see a clean cut guy get arrested in Bondi , I just assume he's a coke dealer","Harry and Meghan – where are you? I can't see you","My week w the royals -- sort of \n\nHarry and Meghan – where are you? I can't see you","So we didn't get nominated for walkleys (tonightly people were robbed) but congrats to those that did - w @danilic @MargieSmithurst","Woo hoo lots of @GuardianAus noms for Walkley including work by @MelissaLDavey & Lisa Martin","'No goodbye at the end of phone calls': readers on things only done in movies","worst nightmare","Damn! Kicked off the bus for being 60c short for a ticket","Just interviewed the Barefoot Investor and had to restrain myself from using the time to get tailored financial advice","Omg Dr Liu!! This guy - who starred in my book Wellmania -- has been abruptly deregistered and his clinics shut!!","Long may they rain ... Prince Harry and Meghan upstaged by Dubbo downpour https://www.theguardian.com/uk-news/2018/oct/17/long-may-they-rain-prince-harry-and-meghan-upstaged-by-dubbo-downpour?CMP=share_btn_tw …\n\nfrom me in DUBBO....","The funniest thing I saw today - @Joe_Hildebrand getting mobbed in dubbo at the royal picnic","eavesdroppiing on a terrifying conversation in this Dubbo cafe... one of the women's friends went into hospital and \"they took the wrong kidney.\"\n\nNO!!","I FINALLY MET THEM!!!","question about expenses --- can I claim news clothes because my old ones got wet in the Dubbo downpour? #RoyalVisitAustralia","v true -- in the rain","Why did I not bring an umbrella to dubbo ?? Bucketing down ! Cmon royals - get here -/ your subjects are getting drenched","Rain bucketing down in dubbo ❤️Farmers here happy #RoyalVisitAustralia","I can't get anywhere near the front !! #RoyalVisitAustralia","What are we doing here? Crowds in Sydney search for Harry and Meghan","Mellow morning gig by Thirsty Merc in dubbo park before royal appearance","You can tell a lot of media in town because everyone at the \"good\" cafe and asking for receipts for one coffee #dubbo","Good morning dubbo !!! Even coffee shops rolling out red carpet","That’s monophagous: the woman who drinks nothing but Pepsi and has done for the past 64 years","Weather in dubbo is dour","biggest mistake - assuming the royal picnic in Dubbo will be sparsely attended so I will get to \"see\" the royals without a step ladder/ media pass -- and instead am told there will be about 30,000 people there","great thread! What If Meghan and harry were normal tourists in Sydney","Welcome to dubbo !","Prine Harry, Meghan royal visit... the Dubbo leg. And literally every single motel room in town is booked out. I am staying next door to all these POLICE who are in the motorcade tomorrow.","Punching mirrors and scrapbooking: things people only do in the movies","I went to see Harry & Meghan -- but all I saw were selfie sticks.....\n\nWhat are we doing here? Crowds in Sydney search for Harry and Meghan","‘It’s OK to be white’ is not a joke, it’s careless politicians helping the far right | Jason Wilson","Re height - being short is only good in negative situations -- like hiding from someone . Positive situations - like royal visit or seeing a concert rewards height","All royal reporters need to be 7 foot tall","I didn't see the royals at the opera house because I'm not tall enough","Woah!","Cosmo magazine, a 'right of passage' for women, to close after 45 years via @ABCNews","from me \n\nMelbourne festival 2018: a clay diorama devastates as old and new worlds collide","Once again - wearing an enormous backpack everywhere is annoying to the public . Being shoved a lot in the back at meaghan and Harry","Opera house - meaghan and Harry","Stanning meaghan --I am so excited about the royal visit that I'm seeing them today at the opera house , then flying to Dubbo to see them again .","Is Tom Hardy's Venom the new Greatest Showman?","the people running for Wentworth look tired","I'm feeling the purity of this exchange w the taxi driver . There is a relief that we don't have to rate each other","Big dick Energy guy now single","The shittiest worst ever bag on the carousel will be mine","Going to try and bang out 20,000 words of a first draft of a novel and have found the perfect writers retreat in a forest that includes a swimming pool & a standing desk 🙏","Trump: Jim Mattis 'sort of a Democrat' and could quit as defense secretary soon","My picks from @melbfestival -- Frogman, Flight, Fire Garden and Polly Borland at the NGV. Such a great program","Kangaroo attack leaves Queensland wildlife carer with collapsed lung","What's the point of making Australian films if nobody gets to see them? | Steve Dow","My favourite sunglasses broke and the grief is real","Last night tonight of amazing Fire Gardens in Melb botanic gardens . Had me hypnotised -/ staring at fire","Legless Japanese businessmen: the photographer who caught a Tokyo epidemic","when I am texting friends about Eugenie's wedding, autocorrect changes it to \"eugenics wedding\" --- which is --- not good","ugh - away for 9 days and have only packed ONE SOCK,,... not even a pair. just one","Travel writer documents survival drinking her own urine after desert fall via @nypost","Ouch \nOne star\n\nPine Gap review – lots of yakkety yak and occasional scenes of bonking","Absolutely stunning day in melbs . It's now Sydney who should take over the mantle of Australia's \"Bleak city \"","best thing that's happened today : locked in a trip to northern Turkey","Richard Branson's personal appeal to Indonesia's president over Bali 9 executions","Tallest mural in the southern hemisphere unveiled in Melbourne","just did an interview (surely my last??) for WELLMANIA ... Canadian people - you can find it on the excellent Face2Face podcast @greystonebooks","Melania Trump says she could be 'the most bullied person' in world","Ryan Gosling movies – ranked!","from me -- an interview w one of Australia's best writers on her great new book\n\n'Who would become an arsonist?': Chloe Hooper on Black Saturday and the nuances of blame","Malcolm's child is speaking. Like an independent thinker.","coming up in my diary today -- I live like a STOIC for a week \n\nand find that some things change - but most things dont.... featuring \n@MichaelRoddan @emilycmulligan and Trav @stupidtrav \n\n@GuardianAus","sto p - hammer time!","I wish people would stop looking at my LinkedIn profile","nothing but respect for my @MikeySlezak","omg --- \nAFP raids home affairs department over Peter Dutton au pair visa leaks","Haruki Murakami: ‘You have to go through the darkness before you get to the light’","I accidentally put too much Vegemite on this toast - and now eating it feels like doing 10 shots of tequila. it's just TOO MUCH","British couple gets drunk, buys hotel they're staying at on honeymoon #FoxNews","what are we?","I got Generation Z!\n\nbut I am not Ge nZ","It's world day against the death penalty -- once again thoughts turn to Andrew, Myuran and their families @MercyCampaign @ReprieveAU","Why are all my ads targeting me on social media for psychics, tarot card readers and 'angel mediums '?\nIs there some information about the future that the algorithms are nudging me towards ??","Hell on earth-- 🔥MSF confirms forced exit from Nauru as refugee mental health 'beyond desperate'","ugh- all flights in Sydney grounded because of storms","Aggressive advertising is bad for us – we must fight back like Sydney","Uber driver so funny : \"that Madonna, she's getting older and older - not good what's happening to her!\"\nIt's like she's the only person on the planet who is aging 😹","Life as a Melb--Syd super commuter: lots of time spent in Uber's travelling to airports listening to Buble on Smooth FM","love this......\n\n#HimToo: how an attempt to criticize #MeToo went delightfully wrong","Still feel a melancholy kind of entertained everytime I see an old repeat of Anthony Bourdain's No Reservations","Hadnt heard of dark kitchens// they sound vile \n\nAre dark kitchens the satanic mills of our era? | John Harris","nightmare,,,, when you accidentally tick the box saying you are bringing weapons onto a plane, then the website doesn't;t let you check in","Fentanyl use surges in Australia, drug monitoring program finds","Gyms are usually horrible, dark , dank dungeons that reek of protein shakes and sweat - but this one in Surry hills smells of blossoms and fresh laundry","What's happening w needles in strawberries ? Has it stopped ?"]